Repository: jbordonado/interactive-resume
Catalog: src/locale/messages.*.xlf
Languages: fr

source: Open sidebar menu
fr: Ouvrir le menu de la barre latérale

source: Interactive resume
fr: CV interactif

source: Navigate to {{ item.name }} version
fr: Naviguer vers la partie {{ item.name }}

source: Download Jordan BORDONADO resume
fr: Télécharger le CV de Jordan BORDONADO

source: Scroll to the top of the page
fr: Faire défiler jusqu'en haut de la page

source: Hey there!
fr: Bonjour !

source: My name is Jordan BORDONADO and I'm a fullstack developer for Air France in Sophia-Antipolis (France).
fr: Mon nom est Jordan BORDONADO et je suis un fullstack developer pour Air France à Sophia-Antipolis (France).

source: I have a lot of passion for development and I like clean code, fairly tested and easy to read so I try to set high expectations for myself.
fr: J'ai beaucoup de passion pour le développement et j'aime le code propre, testé correctement et facile à lire donc j'essaie de me fixer personnellement des attentes élevées.

source: Feel free to dig through the different sections of the site to get to know me.
fr: N'hésitezpas à naviguer à travers les différentes sections du site pour mieux me connaître.

source: You can find my contact details either in the Profile section or in the footer, in case you want to get in touch!
fr: Vous pouvez trouver mes coordonnées de contact soit dans la section Profil soit en bas de page, au cas où vous souhaitez entrer en contact!

source: Also, here is a copy of my resume in case you're interested:
fr: Aussi, vous trouverez ci-après une copie de mon CV au cas où vous seriez intéressé:

source: Jordan BORDONADO's resume
fr: CV de Jordan BORDONADO

source: Download resume of Jordan BORDONADO
fr: Télécharger le CV de Jordan BORDONADO

source: My learning path
fr: Mon parcours d'éducation

source: My professional experiences so far
fr: Mes expériences professionnelles à ce jour

source: Since I graduated, I've only known Air France but this is truly a great environment to improve and meet amazing people in an outstanding place (Sophia-Antipolis is called the 'Small Silicon Valley').
fr: Depuis que je suis diplômé, je n'ai connu qu'Air France mais c'est véritablement un bon environnement pour progresser et rencontrer des personnes extraordinaires dans un lieu exceptionnel (Sophia-Antipolis est appelée la petite Silicon Valley).

source: I'm also glad I've had the chance to work at Amadeus just before, because this is what gave me the confidence to continue on this path and especially in the airline industry.
fr: Je suis également content d'avoir eu la chance de travailler à Amadeus juste avant, car c'est ce qui m'a donné confiance pour continuer dans cette voie et surtout dans l'industrie de l'aérien.

source: Now
fr: Aujourd'hui

source: My certifications
fr: Mes certifications

source: Most of them come from a period of time where I was very interested about Big Data which was the buzzword back then. That's how I learned Scala and found out about functionnal programming (I only knew of Object-oriented programming at that time), which was a blessing considering that I'm using a lot of these concepts at my current company.
fr: La plupart ont été passées durant une période où j'étais très intéressé par le Big Data qui était le mot à la mode à l'époque. C'est comme cela que j'ai appris Scala et découvert la programmation fonctionnelle (je ne connaissais alors que la programmation orientée objet), ce qui fut une chance étant donné que je retrouve beaucoup de ces concepts dans mon rôle aujourd'hui.

source: See certificate
fr: Voir le certificat

source: An overview of my most important skills
fr: Un aperçu de mes compétences les plus importantes

source: Generally speaking, I am eager to learn and I try to go deep on the various topics I deal with. Besides, I always try to keep a positive attitude in a team, which means positive feedback and support at any time.
fr: De manière général, je suis désireux d'apprendre et j'essaie d'aller au bout des choses sur les différentes sujets que je traite. De plus, j'essaie toujours de garder une attitude positive au sein de l'équipe, ce qui signifie du feedbacks positifs et du support à tout moment.

source: I'm a big fan of sports in general, but mostly soccer and tennis
fr: Je suis un grand fan de sports en général, mais plus particulièrement le football et le tennis

source: I love to travel: I've been to quite a few places in Europe and Asia
fr: J'adore voyager : j'ai été dans un bon nombre de lieux en Europe et en Asie

source: I want to learn mandarin and I started to work on that a while ago!
fr: Je veux apprendre le mandarin et j'ai commencé à travailler sur cela il y a déjà un certain moment.

source: Brief information about me
fr: Quelques informations à mon sujet

source: Technical skills
fr: Compétences techniques

source: Soft skills
fr: Compétences générales

source: Teamplayer
fr: Esprit d'équipe

source: Autonomous
fr: Autonome

source: Quick learner
fr: Capacité à apprendre rapidement

source: Resistance to pressure
fr: Résistance à la pression

source: Resilient
fr: Résilient

source: Positive mindset
fr: Bon état d'esprit

source: Home
fr: Accueil

source: Profile
fr: Profil

source: Education
fr: Formation

source: Career
fr: Expériences pro

source: Skills
fr: Compétences

source: {{ age }} years old
fr: {{ age }} ans

source: Overall I'm an experienced developer and I understand very well business needs to deliver high quality items.
fr: Globalement je suis un développeur expérimenté et je comprends parfaitement les besoins business pour délivrer des fonctionnalités de qualité.

source: I enjoy facing challenges and difficult tasks and I'm able to perform well under pressure.
fr: J'apprécie les challenges et les tâches difficiles et je suis capable de travailler efficacement sous la pression

source: I also fit great in a team because I adapt and learn very fast in a new environment, I always make time to provide support or guidance to my colleagues and I love to have feedback on my work and try to expand my knowledge.
fr: Je m'intègre également très bien dans une équipe car je m'adapte et j'apprends rapidement dans un nouvel environnement, je prends toujours le temps de donner des conseils ou de l'aide à mes collègues et j'adore recevoir du feedback sur mon travail and essayer d'améliorer mes connaissances.

source: Engineer in Applied Mathematics and Modelling
fr: Ingénieur en Mathématiques Appliquées et Modélsiation

source: Specialized in mathematics and computer science applied to finance.
fr: Spécialité Informatique et Mathématiques Appliquées à la Finance et à l'Assurance

source: Technical University of Denmark
fr: Université technique du Danemark

source: Master's degree in Applied Mathematics and Modelling
fr: Diplôme de Master en Mathématiques Appliquées et Modélisation

source: Exchange semester in Denmark.
fr: Semestre d'échange au Danemark.

source: Fullstack developer
fr: Développeur Fullstack

source: Development and maintenance of disruption flows (claim creation & follow my claim, flight status, missing baggage declaration) for Air France / KLM joint booking website
fr: Développement et maintenance des flows de disruption (création et suivi de plaintes, statut des vols, déclaration de baggage manquant) pour le site de vente de billets Air France / KLM

source: The project is at the same time very challenging, at the cutting edge of technology, mature (CI/CD with 1 release / day) and multicultural (AF/KLM - english communication).
fr: Le projet est à la fois très stimulant, à la pointe au niveau des technologies, mature (CI/CD avec 1 release / jour) et multiculturel (AF/KLM - communication en anglais).

source: This new website is fully responsive and its traffic is increasing regularly.
fr: Ce nouveau site est entièrement responsive et son trafic augmente régulièrement.

source: Therefore, it requires strong abilities in development (front-end / back-end) as well as communication to follow the rapid pace of the project.
fr: Ainsi, cela demande des compétences solides en développement (front-end / back-end) et également en communication pour être à même de suivre le rythme effrené du projet.

source: I adapted fast and was able to improve and refactor a lot of the project in my team's scope, putting a strong accent on the testing part.
fr: Je me suis adapté rapidement et j'ai été capable de monter en compétences et de faire du refactoring de code sur une grande partie du projet dans le scope de mon équipe, en insistant fortement sur la partie test.

source: Front-end developer
fr: Développeur Front-end

source: Development and maintenance of booking flows (standard / unaccompanied minor / ...) for Air France mobile website (mobile.airfrance.fr)
fr: Développement et maintenance des flows de réservation (standard / mineur non accompagné / ...) pour le site mobile d'Air France (mobile.airfrance.fr)

source: Overall, I had the same kind of responsabilities than in my previous role, except that it was now for the mobile website.
fr: Dans l'ensemble, j'avais les mêmes réponsabilités que dans mon rôle précédant, à part qu'il s'agissait cette fois du site mobile.

source: The main difference was that this project also required to learn the art of release management, in the context of a critical application that generates a high traffic and income.
fr: La principale différence était que le projet demandait également l'apprentissage des procédures de mise en production dans le contexte d'une application critique qui génère un fort trafic et revenu.

source: Front-end developer (Scalian Contractor)
fr: Développeur Front-end (consultant Scalian)

source: Development and maintenance of booking flows (standard / unaccompanied minor / ...) for Air France website (www.airfrance.fr)
fr: Développement et maintenance des flows de réservation (standard / mineur non accompagné / ...) pour le site d'Air France (www.airfrance.fr)

source: This role required a high autonomy since this is an old project with loss of functional knowledge over the years.
fr: Ce projet a demandé une forte autonomie car il s'agit d'un vieux projet qui a connu de nombreux départs depuis sa création, provoquant une perte de connaissance fonctionnelle précieuse au fil du temps.

source: Beside the technical experience I was able to take from this role, it also taught me a lot about cautiousness and how to deal with big projects with a high traffic and income while it has a lot of dependencies.
fr: A part l'expérience au niveau technique que j'ai pu développer grâce à ce rôle, cela m'a également appris à développer avec prudence et rigueur, et cela m'a donné un clair aperçu de la gestion d'un gros projet avec un fort trafic et revenu alors qu'il contient de nombreuses dépendances avec des applications tierces.

source: After a few months, I took on more responsabilities and was an essential part of technical and organizational decisions in the team (architecture, git flow, code review, newcomers training, documentation setup, ...)
fr: Après quelques mois, j'ai pris plus de responsabilités et j'étais un élement essentiel des processus de décisions techniques et organisationnelles au sein de l'équipe (architecture, git flow, code review, formation des nouveaux arrivants, mise en place de documentations, ...)

source: Apprenticeship - Fullstack developer
fr: Apprentissage - Développeur Fullstack

source: Creation of an Internet Booking Engine prototype that will be used as an internal tool to showcase the eRetail XML API to airline customers (data setup, request/response samples, steps to follow, ...)
fr: Création d'un prototype de moteur de réservation qui sera utilisé comme un outil interne pour démontrer l'utilisation de l'API eRetail XML aux compagnies aériennes clientes (configurations techniques en prérequis, échantillon de requêtes/réponses, étapes à suivre, ...)

source: First, it taught me all the basics of an airline booking flow and the technical terms along that so at that point it was already a big win for me.
fr: D'abord, cela m'a appris toutes les connaissances de base sur un flow de réservation d'une compagnie aérienne et le jargon technique associé donc cela était déjà une belle réussite pour moi.

source: Then, I had a lot of autonomy because I was part of a team of functional analyst and no developers, so I had to learn a lot and sharpen my mind to be able to make the right technical and design decisions.
fr: Ensuite, j'avais beaucoup d'autonomie car je faisais partie d'une équipe composée uniquement d'analyste fonctionnel, donc j'ai dû apprendre beaucoup par moi-même et aiguiser mon esprit afin d'être capable de faire les choix techniques et design qui sont les plus justes et adaptés.

source: I was also keen on improving the initial target we set, and in that sense it was appreciated that I was able to come up with a lot of initiatives that made the prototype simply better and useful.
fr: J'étais également très volontaire pour améliorer l'objectif initial défini, et en ce sens mes nombreuses initatives pour rendre le prototype meilleur et plus utile ont été très appréciées.

source: The prototype was eventually a success and we even found a way to deploy it and make it accessible remotely for everyone on Amadeus network, which was a bonus goal initially.
fr: Le prototype fut un succès et nous avons mêmes pu trouver le moyen de déployer l'application avec une solution interne afin de la rendre accessible facilement à n'importe qui connecté au réseau d'Amadeus, ce qui était seulement une étape bonus à la base.

source: At the end of the apprenticeship, I built a lot of confidence in me and I learned a lot on various topics, so I was very grateful to have chosen Amadeus.
fr: A la fin de mon apprentissage, j'ai accumulé beaucoup de confiance en moi et j'ai énormément appris sur de nombreux sujets, donc j'étais très satisfait d'avoir choisi Amadeus.

source: Intership - Developer (maths oriented)
fr: Stage - Développeur (orienté maths)

source: Implementation of the Cucker-Smale mathematical model, based on the construction and analysis of a generic flocking model.
fr: Implémentation du modèle mathématiques de Cucker-Smale, basé sur la construction et l'analyse d'un modèle générique sur le comportement de groupe d'oiseaux.

source: First for the model analysis, I read a lot of scientific papers describing the application fields and the parameters, which eventually made me better at understanding such complicated scientific papers.
fr: D'abord, pour l'analyse du modèle, j'ai lu beaucoup de papiers scientifiques décrivant les domaines d'applications et les paramètres, ce qui m'a permis d'améliorer mes capacités à comprendre des articles scientifiques décrivant des concepts compliqués.

source: Then I was able to implement the mathematical model in MATLAB, to provide simulation of several scenarios both in 2D and in 3D.
fr: Ensuite, j'ai été capable d'implémenter le modèle mathématique sur MATLAB, afin de réaliser des simulations de divers scénarios, en 2D et en 3D.

source: Scientific papers
fr: Articles scientifiques

source: Internship - Developer
fr: Stage - Développeur

source: Creation of dynamic Word forms to optimize the time employees spend on filling them
fr: Création de formulaires dynamiques Word afin d'optimiser le temps que les employées passent à les remplir

source: I first took part to two field missions with an employee to understand the employees' needs and have a global view of the current limitations of their forms.
fr: J'ai d'abord pris part à deux missions sur le terrain avec un agent afin de comprendre les besoins techniques et fonctionnelles des agents et avoir une vision globale des limitations actuelles des formulaires.

source: I then proceeded to automate various actions on the forms (each with ~ 40 pages) such as completion, insertion, deletion of checkboxes, field text, pages or images.
fr: J'ai ensuite procédé à l'automatisation de différentes actions sur les formulaires (chacun comportant ~ 40 pages) telles que le remplissage, l'insertion et la suppression de checkbox, zones de texte, pages ou images.

source: Eventually, I took time to write technical documents describing how to use the new forms and modify them if needed.
fr: Finalement, j'ai pris le temps d'écrire des documentations techniques décrivant comment utiliser les nouveaux formulaires et les modifier si nécessaire.

source: A little extra information about me
fr: Quelques anecdotes supplémentaires à mon sujet

source: {{ currentJobTitle }} (+{{ workingYears }} years experience)
fr: {{ currentJobTitle }} (+{{ workingYears }} années d'expérience)

source: Navigate to french version
fr: Naviguer vers la version française

source: Navigate to english version
fr: Naviguer vers la version anglaise
